---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalService.ServerChangeCause.ImposedChange
enum: Autodesk.Revit.DB.ExternalService.ServerChangeCause
source: html/02016116-f6cf-5d3a-94df-811ef76bdebc.htm
---
# Autodesk.Revit.DB.ExternalService.ServerChangeCause.ImposedChange

The active server is being changed as a result of other operations in Revit.